// ----------------------------------------------------------------------------
// Системные модули
//


// ----------------------------------------------------------------------------
// Собственные модули
//
const app = require('./app')


app.set('port', process.env.PORT || 3001)   // порт по умолчанию - 3001

app.listen(app.get('port'), function() {
  console.log('\nСервер Express запущен в режиме ' + app.get('env') +
              '\nпо адресу http://localhost:' + app.get('port') +
              '\nдля завершения работы сервера нажните Ctrl+C.')
})